Revit 2024 API
UIDocument.PromptForFamilyInstancePlacement Method
Overload List
Name | Description
PromptForFamilyInstancePlacement(FamilySymbol)
Prompts the user to place instances of the specified FamilySymbol.
PromptForFamilyInstancePlacement(FamilySymbol, PromptForFamilyInstancePlacementOptions)
Prompts the user to place instances of the specified FamilySymbol.
See Also
UIDocument Class
UIDocument Members
Autodesk.Revit.UI Namespace